app/controllers/api/v1/matches_controller.rb

SELECT "matches".* FROM "matches"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def index
        matches = Match.all
        our_matches = matches.map { |match| {match_id: match.id, potential_match: (User.find(match.potential_match_id)), user_id: (User.find(match.user_id))} }

INSERT INTO "matches" ("user_id", "potential_match_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 139], ["potential_match_id", 7], ["created_at", "2020-02-08 20:38:44.046647"], ["updated_at", "2020-02-08 20:38:44.046647"]]
---
    def create
        match = Match.create(match_params)

SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 51]]
---
      def destroy
        match = Match.find(params[:id])
        match.destroy