app/controllers/api/v1/preferences_controller.rb

SELECT "preferences".* FROM "preferences"
---
    def index
        preferences = Preference.all

INSERT INTO "preferences" ("user_id", "gender", "minimum_age", "state", "smokes", "drinks", "weed", "drugs", "religion", "education_level", "kids", "relationship_type", "politics", "have_pets", "diet", "created_at", "updated_at", "maximum_age") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
---
    def create
        preference = Preference.create(preference_params)

SELECT "preferences".* FROM "preferences" WHERE "preferences"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "preferences" SET "gender" = $1, "maximum_age" = $2, "minimum_age" = $3, "state" = $4, "weed" = $5, "kids" = $6, "relationship_type" = $7, "updated_at" = $8 WHERE "preferences"."id" = $9  [["gender", ""], ["maximum_age", nil], ["minimum_age", nil], ["state", ""], ["weed", nil], ["kids", nil], ["relationship_type", "Companion"], ["updated_at", "2020-02-10 20:43:20.731833"], ["id", 1]]
---
    def update
        preference = Preference.find(params[:id])
        preference.update(preference_params)