app/controllers/api/v1/preferences_controller.rb

    def index
        preferences = Preference.all
        our_preferences = preferences.map { |preference| {preference_id: preference.id, user_id: (User.find(preference.user_id))} }
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 105], ["LIMIT", 1]]