app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
<<<<<<< HEAD
        user = User.new(
            username: params[:username],
            password: params[:password],
        )
        # user = User.new(user_params)
        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 135], ["LIMIT", 1]]
UPDATE "users" SET "morning_night" = $1, "dress_style" = $2, "summer_winter" = $3, "city_country_suburbs" = $4, "beach_mountain" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["morning_night", ""], ["dress_style", ""], ["summer_winter", ""], ["city_country_suburbs", ""], ["beach_mountain", ""], ["updated_at", "2020-02-09 18:21:14.685734"], ["id", 105]]
---
def update
    user = User.find(params[:id])
    # if
    user.update(user_params)